<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_tensor" type="Parameter" version="opset1">
			<data shape="1,?,?,3" element_type="u8" />
			<output>
				<port id="0" precision="U8" names="input_tensor">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_11500" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="map/while/LogicalAnd" type="Const" version="opset1">
			<data element_type="boolean" shape="" offset="4" size="1" />
			<output>
				<port id="0" precision="BOOL" />
			</output>
		</layer>
		<layer id="3" name="map/while/loop_counter" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="4" name="map/while/maximum_iterations" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="map/Const" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="6" name="map/TensorArrayV2_1" type="Const" version="opset1">
			<data element_type="f32" shape="0, 0" offset="13" size="1" />
			<output>
				<port id="0" precision="FP32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="map/TensorArrayV2_2" type="Const" version="opset1">
			<data element_type="i32" shape="0, 0" offset="13" size="1" />
			<output>
				<port id="0" precision="I32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="map/while" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="2" internal_layer_id="5" />
				<input external_port_id="3" internal_layer_id="4" />
				<input external_port_id="4" internal_layer_id="3" />
				<input external_port_id="5" internal_layer_id="2" />
				<input external_port_id="6" internal_layer_id="1" />
				<input external_port_id="7" internal_layer_id="0" />
				<output external_port_id="8" internal_layer_id="204" />
				<output external_port_id="9" internal_layer_id="69" />
				<output external_port_id="-1" internal_layer_id="14" purpose="execution_condition" />
			</port_map>
			<back_edges>
				<edge from-layer="207" to-layer="5" />
				<edge from-layer="206" to-layer="4" />
				<edge from-layer="205" to-layer="3" />
				<edge from-layer="204" to-layer="2" />
				<edge from-layer="69" to-layer="1" />
				<edge from-layer="15" to-layer="0" />
			</back_edges>
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="BOOL" />
				<port id="2" precision="I32" />
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
				<port id="5" precision="FP32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
				<port id="6" precision="I32">
					<dim>0</dim>
					<dim>0</dim>
				</port>
				<port id="7" precision="U8">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="8" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="5" name="map_while_map_while_loop_counter" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_map_while_loop_counter" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="4" name="map_while_map_while_maximum_iterations" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_map_while_maximum_iterations" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="3" name="map_while_placeholder" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_placeholder" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="2" name="map_while_placeholder_1" type="Parameter" version="opset1">
						<data shape="0,0" element_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_placeholder_1" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>0</dim>
								<dim>0</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="map_while_placeholder_2" type="Parameter" version="opset1">
						<data shape="?,?" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_placeholder_2" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
						</output>
					</layer>
					<layer id="0" name="map_while_tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor_0" type="Parameter" version="opset1">
						<data shape="1,?,?,3" element_type="u8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map_while_tensorarrayv2read_tensorlistgetitem_map_tensorarrayunstack_tensorlistfromtensor_0" />
						</rt_info>
						<output>
							<port id="0" precision="U8">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="map/while/add_1/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="9" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add_1/y" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="7" name="map/while/add_1" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add_1" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" />
						</output>
					</layer>
					<layer id="8" name="map/while/Less_1" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Less_1" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="9" name="map/while/add/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="9" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add/y" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="10" name="map/while/add" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/add" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="I32" />
						</output>
					</layer>
					<layer id="11" name="map/while/Less/y" type="Const" version="opset1">
						<data element_type="i32" shape="" offset="9" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Less/y" />
						</rt_info>
						<output>
							<port id="0" precision="I32" />
						</output>
					</layer>
					<layer id="12" name="map/while/Less" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Less" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="13" name="map/while/LogicalAnd" type="LogicalAnd" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/LogicalAnd" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL" />
							<port id="1" precision="BOOL" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="16" name="Concat_9259" type="Const" version="opset1">
						<data element_type="i32" shape="2" offset="14" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Concat_9259" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>2</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="Reshape_9260" type="Reshape" version="opset1">
						<data special_zero="false" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Reshape_9260" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>-1</dim>
								<dim>-1</dim>
							</port>
							<port id="1" precision="I32">
								<dim>2</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="Squeeze_7079" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Squeeze_10147, Squeeze_7079, Squeeze_9252" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
						</input>
						<output>
							<port id="1" precision="I32" />
						</output>
					</layer>
					<layer id="19" name="Constant_7080" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="5" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7080" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="Gather_7081" type="Gather" version="opset8">
						<data batch_dims="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Gather_7081, map/while/TensorArrayV2Read/TensorListGetItem" />
						</rt_info>
						<input>
							<port id="0" precision="U8">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32" />
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="3" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="map/while/Cast" type="Convert" version="opset1">
						<data destination_type="f32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Cast" />
						</rt_info>
						<input>
							<port id="0" precision="U8">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="22" name="map/while/strided_slice/stack" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="22" size="16" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice/stack" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="23" name="map/while/strided_slice/stack_1" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="22" size="16" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice/stack_1" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="map/while/strided_slice/stack_2" type="Const" version="opset1">
						<data element_type="i32" shape="4" offset="38" size="16" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice/stack_2" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="map/while/strided_slice" type="StridedSlice" version="opset1">
						<data begin_mask="0, 1, 1, 1" end_mask="0, 1, 1, 1" new_axis_mask="1, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/strided_slice" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>4</dim>
							</port>
							<port id="2" precision="I32">
								<dim>4</dim>
							</port>
							<port id="3" precision="I32">
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="Constant_177937" type="Const" version="opset1">
						<data element_type="f32" shape="1, 1, 1, 3" offset="54" size="12" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Split_7089, map/while/Preprocessor/truediv, map/while/Preprocessor/truediv/y, map/while/Preprocessor/truediv_1, map/while/Preprocessor/truediv_1/y" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="27" name="Multiply_172725" type="Multiply" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Split_7089, map/while/Preprocessor/sub, map/while/Preprocessor/sub/y, map/while/Preprocessor/truediv, map/while/Preprocessor/truediv/y, map/while/Preprocessor/truediv_1, map/while/Preprocessor/truediv_1/y" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="28" name="Constant_177938" type="Const" version="opset1">
						<data element_type="f32" shape="1, 1, 1, 3" offset="66" size="12" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Split_7089, map/while/Preprocessor/sub, map/while/Preprocessor/sub/y, map/while/Preprocessor/truediv_1, map/while/Preprocessor/truediv_1/y" />
						</rt_info>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="map/while/Preprocessor/truediv_1" type="Add" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Split_7089, map/while/Preprocessor/sub, map/while/Preprocessor/sub/y, map/while/Preprocessor/truediv_1, map/while/Preprocessor/truediv_1/y" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="30" name="Constant_7088" type="Const" version="opset1">
						<data element_type="i64" shape="" offset="78" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_7088" />
						</rt_info>
						<output>
							<port id="0" precision="I64" />
						</output>
					</layer>
					<layer id="31" name="Squeeze_7090" type="Squeeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Squeeze_7090" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
							<port id="1" precision="I64" />
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="32" name="map/while/Preprocessor/ResizeToRange/Shape" type="ShapeOf" version="opset3">
						<data output_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/Shape, map/while/Preprocessor/ResizeToRange/Shape_1" />
						</rt_info>
						<input>
							<port id="0" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="I32">
								<dim>3</dim>
							</port>
						</output>
					</layer>
					<layer id="33" name="map/while/Preprocessor/ResizeToRange/strided_slice/stack" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="5" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice/stack" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="34" name="map/while/Preprocessor/ResizeToRange/strided_slice/stack_1" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="9" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice/stack_1" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="35" name="map/while/Preprocessor/ResizeToRange/strided_slice/stack_2" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="9" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice/stack_2" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="36" name="map/while/Preprocessor/ResizeToRange/strided_slice" type="StridedSlice" version="opset1">
						<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice, map/while/Preprocessor/ResizeToRange/strided_slice/stack, map/while/Preprocessor/ResizeToRange/strided_slice/stack_1, map/while/Preprocessor/ResizeToRange/strided_slice/stack_2" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="I32" />
						</output>
					</layer>
					<layer id="37" name="map/while/Preprocessor/ResizeToRange/strided_slice_1/stack" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="9" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice_1/stack" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="38" name="map/while/Preprocessor/ResizeToRange/strided_slice_1/stack_1" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="86" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice_1/stack_1" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="39" name="map/while/Preprocessor/ResizeToRange/strided_slice_1/stack_2" type="Const" version="opset1">
						<data element_type="i32" shape="1" offset="9" size="4" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice_1/stack_2" />
						</rt_info>
						<output>
							<port id="0" precision="I32">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="40" name="map/while/Preprocessor/ResizeToRange/strided_slice_1" type="StridedSlice" version="opset1">
						<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" ellipsis_mask="0" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/strided_slice_1, map/while/Preprocessor/ResizeToRange/strided_slice_1/stack, map/while/Preprocessor/ResizeToRange/strided_slice_1/stack_1, map/while/Preprocessor/ResizeToRange/strided_slice_1/stack_2" />
						</rt_info>
						<input>
							<port id="0" precision="I32">
								<dim>3</dim>
							</port>
							<port id="1" precision="I32">
								<dim>1</dim>
							</port>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
							<port id="3" precision="I32">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="4" precision="I32" />
						</output>
					</layer>
					<layer id="41" name="map/while/Preprocessor/ResizeToRange/Less" type="Less" version="opset1">
						<data auto_broadcast="numpy" />
						<rt_info>
							<attribute name="fused_names" version="0" value="map/while/Preprocessor/ResizeToRange/Less" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I32" />
						</input>
						<output>
							<port id="2" precision="BOOL" />
						</output>
					</layer>
					<layer id="42" name="If_8270" type="If" version="opset8">
						<else_port_map>
							<input external_port_id="1" internal_layer_id="0" />
							<output external_port_id="2" internal_layer_id="39" />
						</else_port_map>
						<then_port_map>
							<input external_port_id="1" internal_layer_id="0" />
							<output external_port_id="2" internal_layer_id="39" />
						</then_port_map>
						<rt_info>
							<attribute name="fused_names" version="0" value="If_8270" />
						</rt_info>
						<input>
							<port id="0" precision="BOOL" />
							<port id="1" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>-1</dim>
								<dim>-1</dim>
								<dim>3</dim>
							</port>
						</output>
						<then_body>
							<layers>
								<layer id="0" name="map_while_preprocessor_resizetorange_cond_resize_expanddims_map_while_preprocessor_unstack" type="Parameter" version="opset1">
									<data shape="?,?,3" element_type="f32" />
									<output>
										<port id="0" precision="FP32">
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</output>
								</layer>
								<layer id="1" name="map/while/Preprocessor/ResizeToRange/cond/resize/ExpandDims/dim" type="Const" version="opset1">
									<data element_type="i32" shape="" offset="5" size="4" />
									<output>
										<port id="0" precision="I32" />
									</output>
								</layer>
								<layer id="2" name="map/while/Preprocessor/ResizeToRange/cond/resize/ExpandDims" type="Unsqueeze" version="opset1">
									<input>
										<port id="0" precision="FP32">
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
										<port id="1" precision="I32" />
									</input>
									<output>
										<port id="2" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</output>
								</layer>
								<layer id="3" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast" type="Const" version="opset1">
									<data element_type="f32" shape="" offset="90" size="4" />
									<output>
										<port id="0" precision="FP32" />
									</output>
								</layer>
								<layer id="4" name="map/while/Preprocessor/ResizeToRange/cond/resize/Shape" type="ShapeOf" version="opset3">
									<data output_type="i32" />
									<input>
										<port id="0" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</input>
									<output>
										<port id="1" precision="I32">
											<dim>4</dim>
										</port>
									</output>
								</layer>
								<layer id="5" name="Constant_7106" type="Const" version="opset1">
									<data element_type="i64" shape="" offset="78" size="8" />
									<output>
										<port id="0" precision="I64" />
									</output>
								</layer>
								<layer id="6" name="Split_7107" type="Split" version="opset1">
									<data num_splits="4" />
									<input>
										<port id="0" precision="I32">
											<dim>4</dim>
										</port>
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32">
											<dim>1</dim>
										</port>
										<port id="3" precision="I32">
											<dim>1</dim>
										</port>
										<port id="4" precision="I32">
											<dim>1</dim>
										</port>
										<port id="5" precision="I32">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="7" name="Squeeze_7109" type="Squeeze" version="opset1">
									<input>
										<port id="0" precision="I32">
											<dim>1</dim>
										</port>
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32" />
									</output>
								</layer>
								<layer id="8" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_1" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="9" name="map/while/Preprocessor/ResizeToRange/cond/resize/truediv" type="Divide" version="opset1">
									<data auto_broadcast="numpy" m_pythondiv="true" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="10" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_2" type="Const" version="opset1">
									<data element_type="f32" shape="" offset="90" size="4" />
									<output>
										<port id="0" precision="FP32" />
									</output>
								</layer>
								<layer id="11" name="Squeeze_7110" type="Squeeze" version="opset1">
									<input>
										<port id="0" precision="I32">
											<dim>1</dim>
										</port>
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32" />
									</output>
								</layer>
								<layer id="12" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_3" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="13" name="map/while/Preprocessor/ResizeToRange/cond/resize/truediv_1" type="Divide" version="opset1">
									<data auto_broadcast="numpy" m_pythondiv="true" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="14" name="map/while/Preprocessor/ResizeToRange/cond/resize/Minimum" type="Minimum" version="opset1">
									<data auto_broadcast="numpy" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="15" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_4" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="16" name="map/while/Preprocessor/ResizeToRange/cond/resize/mul" type="Multiply" version="opset1">
									<data auto_broadcast="numpy" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="17" name="map/while/Preprocessor/ResizeToRange/cond/resize/Round" type="Round" version="opset5">
									<data mode="half_to_even" />
									<input>
										<port id="0" precision="FP32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="18" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_5" type="Convert" version="opset1">
									<data destination_type="i32" />
									<input>
										<port id="0" precision="FP32" />
									</input>
									<output>
										<port id="1" precision="I32" />
									</output>
								</layer>
								<layer id="19" name="Constant_7136" type="Const" version="opset1">
									<data element_type="i64" shape="" offset="78" size="8" />
									<output>
										<port id="0" precision="I64" />
									</output>
								</layer>
								<layer id="20" name="Unsqueeze_7137" type="Unsqueeze" version="opset1">
									<input>
										<port id="0" precision="I32" />
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="21" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_6" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="22" name="map/while/Preprocessor/ResizeToRange/cond/resize/mul_1" type="Multiply" version="opset1">
									<data auto_broadcast="numpy" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="23" name="map/while/Preprocessor/ResizeToRange/cond/resize/Round_1" type="Round" version="opset5">
									<data mode="half_to_even" />
									<input>
										<port id="0" precision="FP32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="24" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_7" type="Convert" version="opset1">
									<data destination_type="i32" />
									<input>
										<port id="0" precision="FP32" />
									</input>
									<output>
										<port id="1" precision="I32" />
									</output>
								</layer>
								<layer id="25" name="Unsqueeze_7138" type="Unsqueeze" version="opset1">
									<input>
										<port id="0" precision="I32" />
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="26" name="map/while/Preprocessor/ResizeToRange/cond/resize/size" type="Concat" version="opset1">
									<data axis="0" />
									<input>
										<port id="0" precision="I32">
											<dim>1</dim>
										</port>
										<port id="1" precision="I32">
											<dim>1</dim>
										</port>
									</input>
									<output>
										<port id="2" precision="I32">
											<dim>2</dim>
										</port>
									</output>
								</layer>
								<layer id="27" name="Convert_7146" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32">
											<dim>2</dim>
										</port>
									</input>
									<output>
										<port id="1" precision="FP32">
											<dim>2</dim>
										</port>
									</output>
								</layer>
								<layer id="28" name="ShapeOf_7140" type="ShapeOf" version="opset3">
									<data output_type="i32" />
									<input>
										<port id="0" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</input>
									<output>
										<port id="1" precision="I32">
											<dim>4</dim>
										</port>
									</output>
								</layer>
								<layer id="29" name="Constant_7141" type="Const" version="opset1">
									<data element_type="i64" shape="1" offset="94" size="8" />
									<output>
										<port id="0" precision="I64">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="30" name="Constant_7142" type="Const" version="opset1">
									<data element_type="i64" shape="1" offset="102" size="8" />
									<output>
										<port id="0" precision="I64">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="31" name="Constant_7143" type="Const" version="opset1">
									<data element_type="i64" shape="1" offset="94" size="8" />
									<output>
										<port id="0" precision="I64">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="32" name="Slice_7145" type="StridedSlice" version="opset1">
									<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
									<input>
										<port id="0" precision="I32">
											<dim>4</dim>
										</port>
										<port id="1" precision="I64">
											<dim>1</dim>
										</port>
										<port id="2" precision="I64">
											<dim>1</dim>
										</port>
										<port id="3" precision="I64">
											<dim>1</dim>
										</port>
									</input>
									<output>
										<port id="4" precision="I32">
											<dim>2</dim>
										</port>
									</output>
								</layer>
								<layer id="33" name="Convert_7147" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32">
											<dim>2</dim>
										</port>
									</input>
									<output>
										<port id="1" precision="FP32">
											<dim>2</dim>
										</port>
									</output>
								</layer>
								<layer id="34" name="Divide_7148" type="Divide" version="opset1">
									<data auto_broadcast="numpy" m_pythondiv="true" />
									<input>
										<port id="0" precision="FP32">
											<dim>2</dim>
										</port>
										<port id="1" precision="FP32">
											<dim>2</dim>
										</port>
									</input>
									<output>
										<port id="2" precision="FP32">
											<dim>2</dim>
										</port>
									</output>
								</layer>
								<layer id="35" name="Constant_7149" type="Const" version="opset1">
									<data element_type="i32" shape="2" offset="110" size="8" />
									<output>
										<port id="0" precision="I32">
											<dim>2</dim>
										</port>
									</output>
								</layer>
								<layer id="36" name="map/while/Preprocessor/ResizeToRange/cond/resize/ResizeBilinear" type="Interpolate" version="opset4">
									<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="asymmetric" nearest_mode="round_prefer_floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
									<input>
										<port id="0" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
										<port id="1" precision="I32">
											<dim>2</dim>
										</port>
										<port id="2" precision="FP32">
											<dim>2</dim>
										</port>
										<port id="3" precision="I32">
											<dim>2</dim>
										</port>
									</input>
									<output>
										<port id="4" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</output>
								</layer>
								<layer id="37" name="Constant_7392" type="Const" version="opset1">
									<data element_type="i32" shape="1" offset="5" size="4" />
									<output>
										<port id="0" precision="I32">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="38" name="map/while/Preprocessor/ResizeToRange/cond/resize/Squeeze" type="Squeeze" version="opset1">
									<input>
										<port id="0" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
										<port id="1" precision="I32">
											<dim>1</dim>
										</port>
									</input>
									<output>
										<port id="2" precision="FP32">
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</output>
								</layer>
								<layer id="39" name="map_while_preprocessor_resizetorange_cond_identity" type="Result" version="opset1">
									<input>
										<port id="0" precision="FP32">
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</input>
								</layer>
							</layers>
							<edges>
								<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
								<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
								<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
								<edge from-layer="2" from-port="2" to-layer="36" to-port="0" />
								<edge from-layer="2" from-port="2" to-layer="28" to-port="0" />
								<edge from-layer="3" from-port="0" to-layer="9" to-port="0" />
								<edge from-layer="4" from-port="1" to-layer="6" to-port="0" />
								<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
								<edge from-layer="5" from-port="0" to-layer="7" to-port="1" />
								<edge from-layer="5" from-port="0" to-layer="11" to-port="1" />
								<edge from-layer="6" from-port="3" to-layer="7" to-port="0" />
								<edge from-layer="6" from-port="4" to-layer="11" to-port="0" />
								<edge from-layer="7" from-port="2" to-layer="8" to-port="0" />
								<edge from-layer="7" from-port="2" to-layer="15" to-port="0" />
								<edge from-layer="8" from-port="1" to-layer="9" to-port="1" />
								<edge from-layer="9" from-port="2" to-layer="14" to-port="0" />
								<edge from-layer="10" from-port="0" to-layer="13" to-port="0" />
								<edge from-layer="11" from-port="2" to-layer="21" to-port="0" />
								<edge from-layer="11" from-port="2" to-layer="12" to-port="0" />
								<edge from-layer="12" from-port="1" to-layer="13" to-port="1" />
								<edge from-layer="13" from-port="2" to-layer="14" to-port="1" />
								<edge from-layer="14" from-port="2" to-layer="16" to-port="0" />
								<edge from-layer="14" from-port="2" to-layer="22" to-port="0" />
								<edge from-layer="15" from-port="1" to-layer="16" to-port="1" />
								<edge from-layer="16" from-port="2" to-layer="17" to-port="0" />
								<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
								<edge from-layer="18" from-port="1" to-layer="20" to-port="0" />
								<edge from-layer="19" from-port="0" to-layer="20" to-port="1" />
								<edge from-layer="19" from-port="0" to-layer="25" to-port="1" />
								<edge from-layer="20" from-port="2" to-layer="26" to-port="0" />
								<edge from-layer="21" from-port="1" to-layer="22" to-port="1" />
								<edge from-layer="22" from-port="2" to-layer="23" to-port="0" />
								<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
								<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
								<edge from-layer="25" from-port="2" to-layer="26" to-port="1" />
								<edge from-layer="26" from-port="2" to-layer="27" to-port="0" />
								<edge from-layer="26" from-port="2" to-layer="36" to-port="1" />
								<edge from-layer="27" from-port="1" to-layer="34" to-port="0" />
								<edge from-layer="28" from-port="1" to-layer="32" to-port="0" />
								<edge from-layer="29" from-port="0" to-layer="32" to-port="1" />
								<edge from-layer="30" from-port="0" to-layer="32" to-port="2" />
								<edge from-layer="31" from-port="0" to-layer="32" to-port="3" />
								<edge from-layer="32" from-port="4" to-layer="33" to-port="0" />
								<edge from-layer="33" from-port="1" to-layer="34" to-port="1" />
								<edge from-layer="34" from-port="2" to-layer="36" to-port="2" />
								<edge from-layer="35" from-port="0" to-layer="36" to-port="3" />
								<edge from-layer="36" from-port="4" to-layer="38" to-port="0" />
								<edge from-layer="37" from-port="0" to-layer="38" to-port="1" />
								<edge from-layer="38" from-port="2" to-layer="39" to-port="0" />
							</edges>
							<rt_info />
						</then_body>
						<else_body>
							<layers>
								<layer id="0" name="map_while_preprocessor_resizetorange_cond_resize_expanddims_map_while_preprocessor_unstack" type="Parameter" version="opset1">
									<data shape="?,?,3" element_type="f32" />
									<output>
										<port id="0" precision="FP32">
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</output>
								</layer>
								<layer id="1" name="map/while/Preprocessor/ResizeToRange/cond/resize/ExpandDims/dim" type="Const" version="opset1">
									<data element_type="i32" shape="" offset="5" size="4" />
									<output>
										<port id="0" precision="I32" />
									</output>
								</layer>
								<layer id="2" name="map/while/Preprocessor/ResizeToRange/cond/resize/ExpandDims" type="Unsqueeze" version="opset1">
									<input>
										<port id="0" precision="FP32">
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
										<port id="1" precision="I32" />
									</input>
									<output>
										<port id="2" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</output>
								</layer>
								<layer id="3" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast" type="Const" version="opset1">
									<data element_type="f32" shape="" offset="90" size="4" />
									<output>
										<port id="0" precision="FP32" />
									</output>
								</layer>
								<layer id="4" name="map/while/Preprocessor/ResizeToRange/cond/resize/Shape" type="ShapeOf" version="opset3">
									<data output_type="i32" />
									<input>
										<port id="0" precision="FP32">
											<dim>1</dim>
											<dim>-1</dim>
											<dim>-1</dim>
											<dim>3</dim>
										</port>
									</input>
									<output>
										<port id="1" precision="I32">
											<dim>4</dim>
										</port>
									</output>
								</layer>
								<layer id="5" name="Constant_7690" type="Const" version="opset1">
									<data element_type="i64" shape="" offset="78" size="8" />
									<output>
										<port id="0" precision="I64" />
									</output>
								</layer>
								<layer id="6" name="Split_7691" type="Split" version="opset1">
									<data num_splits="4" />
									<input>
										<port id="0" precision="I32">
											<dim>4</dim>
										</port>
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32">
											<dim>1</dim>
										</port>
										<port id="3" precision="I32">
											<dim>1</dim>
										</port>
										<port id="4" precision="I32">
											<dim>1</dim>
										</port>
										<port id="5" precision="I32">
											<dim>1</dim>
										</port>
									</output>
								</layer>
								<layer id="7" name="Squeeze_7693" type="Squeeze" version="opset1">
									<input>
										<port id="0" precision="I32">
											<dim>1</dim>
										</port>
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32" />
									</output>
								</layer>
								<layer id="8" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_1" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="9" name="map/while/Preprocessor/ResizeToRange/cond/resize/truediv" type="Divide" version="opset1">
									<data auto_broadcast="numpy" m_pythondiv="true" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="10" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_2" type="Const" version="opset1">
									<data element_type="f32" shape="" offset="90" size="4" />
									<output>
										<port id="0" precision="FP32" />
									</output>
								</layer>
								<layer id="11" name="Squeeze_7694" type="Squeeze" version="opset1">
									<input>
										<port id="0" precision="I32">
											<dim>1</dim>
										</port>
										<port id="1" precision="I64" />
									</input>
									<output>
										<port id="2" precision="I32" />
									</output>
								</layer>
								<layer id="12" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_3" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="13" name="map/while/Preprocessor/ResizeToRange/cond/resize/truediv_1" type="Divide" version="opset1">
									<data auto_broadcast="numpy" m_pythondiv="true" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="14" name="map/while/Preprocessor/ResizeToRange/cond/resize/Minimum" type="Minimum" version="opset1">
									<data auto_broadcast="numpy" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="15" name="map/while/Preprocessor/ResizeToRange/cond/resize/Cast_4" type="Convert" version="opset1">
									<data destination_type="f32" />
									<input>
										<port id="0" precision="I32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
								<layer id="16" name="map/while/Preprocessor/ResizeToRange/cond/resize/mul" type="Multiply" version="opset1">
									<data auto_broadcast="numpy" />
									<input>
										<port id="0" precision="FP32" />
										<port id="1" precision="FP32" />
									</input>
									<output>
										<port id="2" precision="FP32" />
									</output>
								</layer>
								<layer id="17" name="map/while/Preprocessor/ResizeToRange/cond/resize/Round" type="Round" version="opset5">
									<data mode="half_to_even" />
									<input>
										<port id="0" precision="FP32" />
									</input>
									<output>
										<port id="1" precision="FP32" />
									</output>
								</layer>
